; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	image1 - mode
	image2 - mode
	infrared4 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon7 infrared3)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared5)
	(have_image Phenomenon10 infrared4)
	(have_image Planet11 image1)
	(have_image Planet12 image1)
	(have_image Planet12 infrared3)
	(have_image Star13 infrared4)
))

)

; plan
1. (turn_to satellite0 groundstation5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 0 of 10
5. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 1 of 10
6. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 2 of 10
7. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 10
8. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon9 instrument0 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 4 of 10
11. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 4 of 10
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 10
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
14. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon7 instrument1 image2)
   added: (have_image phenomenon7 image2)
   goals met: 5 of 10
17. (take_image satellite0 phenomenon7 instrument1 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 6 of 10
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 10
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 10
20. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 10
21. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 6 of 10
22. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 10
23. (take_image satellite0 phenomenon10 instrument2 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 7 of 10
24. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 7 of 10
25. (take_image satellite0 planet8 instrument2 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 8 of 10
26. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 8 of 10
27. (take_image satellite0 star13 instrument2 infrared4)
   added: (have_image star13 infrared4)
   goals met: 9 of 10
28. (turn_to satellite0 groundstation3 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation3)
   goals met: 10 of 10
